/*******************************************************

* 文件名：my_drv_task.c

* 作者：  luyangguang

* 描述： drv底层驱动任务

* 修改人：〈卢阳光〉

* 修改时间：2021-04-24

* 修改内容：创建
*******************************************************/

/*******************  头文件包含 ***********************/
/******************************************************/

#include "my_drv_task.h"

#include "my_led.h"
#include "my_com.h" 
#include "my_master_task.h"
#include "my_drv_main.h"
#include "my_uart.h"

/******************************************************/
/*******************  全局变量定义 *********************/
/******************************************************/
static QueueHandle_t my_drv_queue_handle;

/******************************************************/
/*******************  数据类型定义 *********************/
/******************************************************/

/******************************************************/
/*******************  外部变量引用 *********************/
/******************************************************/

/******************************************************/
/*******************  本地函数声明 *********************/
/******************************************************/

/******************************************************/
/*******************  外部函数引用 *********************/
/******************************************************/


/******************************************************
* 函数名 : my_drv_task_main
* 函数功能描述 : 程序的开始，主函数入口
* 函数参数 : 
* 函数返回值 : 
* 作者 : luyangguang
* 版本 : 1.0
* 历史版本 : 无
*******************************************************/
void my_drv_task_main(void)
{
		my_task_message_struct drv_message = {0};
		
		my_led_init();
		
		USART_Config();
	
		while(xQueueReceive(my_drv_queue_handle,&drv_message,portMAX_DELAY))
		{
				switch(drv_message.mes_id)
				{
					case MY_DRV_UART_DATA_SEND:
								{
										MY_DRV_UART_DATA_SEND_handle(&drv_message);	
								}
								vPortFree(drv_message.pvdata);
								break;
								
					case 8:
								{
										palLED1_ON ();			  // 亮
										vTaskDelay( 5000 );
										palLED1_OFF ();		  // 灭		
										vTaskDelay( 5000 );										
								}
								break;								
					default:
							  break;
												
				}

		}
			
	
}

/******************************************************
* 函数名 : my_drv_task_get_queuue_handle
* 函数功能描述 : 获取drv任务的队列句柄
* 函数参数 : 
* 函数返回值 : 
* 作者 : luyangguang
* 版本 : 1.0
* 历史版本 : 无
*******************************************************/
QueueHandle_t my_drv_task_get_queuue_handle(void)
{
		return my_drv_queue_handle;
}


/******************************************************
* 函数名 : my_drv_task_init
* 函数功能描述 : drv任务初始化
* 函数参数 : 
* 函数返回值 : 
* 作者 : luyangguang
* 版本 : 1.0
* 历史版本 : 无
*******************************************************/
void my_drv_task_init( void * pvParameters )
{	
		my_drv_queue_handle = xQueueCreate(50,sizeof(my_task_message_struct));
		my_drv_task_main();
		
}

